Extensions/FortMonitorAPI_ТЛЭ/Catalogs/уатУчетныеЗаписиСистемыМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уатУчетныеЗаписиСистемыМониторинга</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СистемаМониторинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидСистемы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТокенАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВерсииАвтоГРАФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_БезЗащиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ИмяПараметраСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/FortMonitorAPI_ТЛЭ/Catalogs/SDL_НастройкиФортМонитор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>SDL_НастройкиФортМонитор</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФортМонитор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатУчетныеЗаписиСистемыМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаМониторинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалЗагрузки</Name>
					<Comment>Загрузка данных регламентным заданием за указанное время (хранится в сек.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузитьПробегРасход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузитьДопСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузитьКоординаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SDL_ЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ЧасовойПоясБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SDL_ЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_РаботаСHTTPСервисами</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ПересчетОдометраПоПробегуНаВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ИспользоватьУниверсальноеВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ПересчетПробегаПоОдометруНаВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/FortMonitorAPI_ТЛЭ/CommonModules/уатРаботаСРасширениямиКлиент/Ext/Module.bsl
&После("ПСМ_ВыполнитьДействияВФорме")
Процедура SDL_ПСМ_ВыполнитьДействияВФорме(ИдентификаторДействия, СистемаМониторинга, УчетнаяЗапись, ЭтотОбъект, ДопПараметры)
	
	Если СистемаМониторинга = SDL_ФортМонитор.ИмяСистемыФортМонитор() Тогда 
		Если ИдентификаторДействия = "ОбщаяФорма.уатНастройкиМониторинга.НастройкиПСМ" Тогда 
			
			// Открыть настройки системы ФортМонитор
			SDL_ОткрытьНастройкиФортМонитор();
				
		ИначеЕсли ИдентификаторДействия = "Справочник.уатУчетныеЗаписиСистемыМониторинга.ПроверитьПодключение" 
			Или ИдентификаторДействия = "Справочник.SDL_НастройкиФортМонитор.ПроверитьПодключение"
			Тогда 				
			
			Если ЭтотОбъект.Модифицированность Тогда 
				
				ДополнительныеПараметры = Новый Структура("УчетнаяЗапись, Форма", УчетнаяЗапись, ЭтотОбъект);
				
				ОбработкаОповещенияЗаписиФормыУчетнойЗаписи = Новый ОписаниеОповещения("ОбработкаВопросаЗаписиФормыУчетнойЗаписи", 
					уатРаботаСРасширениямиКлиент, ДополнительныеПараметры);
					
				ПоказатьВопрос(ОбработкаОповещенияЗаписиФормыУчетнойЗаписи, "Необходимо сохранить данные учетной записи. Записать?", РежимДиалогаВопрос.ДаНет);
				
			Иначе
			    Токен = ""; 
				SDL_ИмяПараметраСессии = "";
				SDL_ПроверитьПодключениеФортМонитор(УчетнаяЗапись, ЭтотОбъект, Токен,SDL_ИмяПараметраСессии);
				Если ЗначениеЗаполнено(Токен) Тогда
				      уатРаботаСРасширениями.ЗаписатьТокен(УчетнаяЗапись,Токен,SDL_ИмяПараметраСессии);   
					  Оповестить("ОбновленТокенАвторизации",,ЭтотОбъект);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура SDL_ОткрытьНастройкиФортМонитор()
	
	НастройкаФортМонитор = SDL_ФортМонитор.АктивнаяНастройкаФортМонитор();
	ПараметрыОткрытияФормы = Новый Структура("Ключ", НастройкаФортМонитор);
	
	ОткрытьФорму("Справочник.SDL_НастройкиФортМонитор.Форма.ФормаЭлемента", ПараметрыОткрытияФормы,
		,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
Процедура SDL_ПроверитьПодключениеФортМонитор(УчетнаяЗапись, Форма, Токен,SDL_ИмяПараметраСессии )
	
	РезультатПроверки = SDL_РаботаСHTTPСервисами.ПроверитьАвторизацию(УчетнаяЗапись);
	
	Если ЗначениеЗаполнено(РезультатПроверки.Токен) Тогда 
		Токен = РезультатПроверки.Токен;
		SDL_ИмяПараметраСессии = РезультатПроверки.SDL_ИмяПараметраСессии;    
		//Форма.Модифицированность = Истина; 
		//ОповеститьОбИзменении(УчетнаяЗапись);
	КонецЕсли;
	
	ПоказатьПредупреждение(, РезультатПроверки.ТекстОтвета,, "Проверка подключения Fort Monitor");
	
КонецПроцедуры

Процедура ОбработкаВопросаЗаписиФормыУчетнойЗаписи(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда 
		
		ДополнительныеПараметры.Форма.Записать();
		//SDL_ПроверитьПодключениеФортМонитор(ДополнительныеПараметры.Форма.Объект.Ссылка, ДополнительныеПараметры.Форма);
		
	КонецЕсли;
	
КонецПроцедуры
